#### FluidViscosity Property

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   See Also |

The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ftÂ·s)).

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double FluidViscosity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FluidViscosity As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double FluidViscosity { 	double get (); } ``` |

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace